import {Box, Link, Stack, Typography} from "@mui/material";

const FAQS = [
  {
    id: 0,
    value: `panel1`,
    heading: 'מה זה איירסופט?',
    detail: (
      <Stack spacing={2}>
        <Typography variant="body2">
          איירסופט הוא משחק מלחמה, ספורט, ותחביב.
          <br />
          כל הכלים באיירסופט הם צעצועים, וכל התלבושות הן תחפושות.
          <br />
          כלי האיירסופט (וגם המשחק) הומצאו במקור ביפן - שם לאזרחים אין
          אפשרות לקבל רשיון נשק והם רצו פתרון ספורטיבי ולא קטלני וכך הומצאו
          הכלים הראשונים.
        </Typography>

        <Typography variant="body2">
          היות וכלי המשחק עצמם הם צעצועים מסוכנים, והמשחקים הינם בעצימות
          גופנית גבוהה - הספורט נחשב לאקסטרימי, ודורש מיגון תקני והקפדה על
          כללי בטיחות (תוך שימת דגש על שמירת העיניים ואיזור הפנים). בנוסף
          למיגון תקני, מבצעים בדיקות עוצמה לכל הכלים בתחילת כל משחק,
          ומוודאים שכל השחקנים נמצאים בטווחי הבטיחות מכיוון שכלים יורים
          בעוצמה משתנה בהתאם למזג האוויר, מצב הסוללה, כדורים במשקלים שונים..
        </Typography>

        <Typography variant="body2">
          כלי האיירסופט נועדו לחקות כלים אמיתיים מבחינת גודל, משקל, הרגשה
          ותפעול, ולכן לעיתים תשמעו אנשים קוראים לכלי איירסופט "רפליקה", אך
          הכלים עובדים בדר"כ על מנוע חשמלי או לחץ גז, ויורים כדורי פלסטיק
          דחוס בקוטר של 6 מ"מ, כמו כן כלי האיירסופט אינם נועדו לשימוש אמיתי
          ולכן לרוב מדובר על כלים שעשויים מתכות זולות ופולימרים נפוצים.
        </Typography>
      </Stack>
    )
  },
  {
    id: 1,
    value: `panel2`,
    heading: 'האם זה חוקי?',
    detail: (
        <Stack spacing={2}>
          <Typography variant="body2">
            כן! איירסופט הוא תחביב חוקי לחלוטין, התחום עוד יחסית צעיר בארץ
            (ולא בגלל שהוא חדש) ולא מוכר לחלקים נרחבים באוכלוסיה, אבל אין אף
            מניעה חוקית לעסוק באיירסופט. עם זאת, התחום אינו פרוץ לחלוטין, ישנם
            כבר היום חוקים ותקנות במדינת ישראל המגבילים את השימוש, היבוא
            והמכירה של כלי איירסופט וצריך להכיר אותם ולעמוד בהם.
          </Typography>

          <Stack spacing={2}>
            <Box>
              <Typography
                  variant="h5"
                  sx={{ textDecoration: "underline", color: "primary.darker" }}
              >
                אז מה זה "חוק האיירסופט" בעצם?
              </Typography>
              <Typography variant="body2">
                זה למעשה כינוי גורף לרגולציה ולעדכוני חקיקה בנושאי נשק, דמוי
                נשק וצעצועים מסוכנים. הרגולציה המדוברת נעשית בשלבים רבים
                 ופועלת על מנת להגדיר ולהכניס את כלי האיירסופט לחוק.
              </Typography>
              <Link
                  sx={{
                    color: "blue",
                    "&:hover": {
                      color: "red",
                      textDecoration: "underline",
                    },
                    fontWeight: "bold",
                  }}
                  href="https://www.tazkirim.gov.il/s/law-item/a093Y00001YibMaQAJ/%D7%AA%D7%96%D7%9B%D7%99%D7%A8-%D7%97%D7%95%D7%A7-%D7%9B%D7%9C%D7%99-%D7%94%D7%99%D7%A8%D7%99%D7%99%D7%94-%D7%AA%D7%99%D7%A7%D7%95%D7%9F-%D7%9E%D7%A1-22-%D7%93%D7%9E%D7%95%D7%99-%D7%9B%D7%9C%D7%99-%D7%99%D7%A8%D7%99%D7%99%D7%94-%D7%94%D7%AA%D7%A9%D7%A4%D7%912022?language=iw"
                  target="_blank"
                  rel="airsoft website1"
              >
                כאן ניתן
                לעיין בגרסאת החוק נכון לפברואר 2024
              </Link>
              <Typography variant="body2">
                מעבר לחוק עצמו ישנן תקנות או צווי שעה והוראות עזר, ולרוב מדובר
                בתקנות בנושאים שעדיין לא נכנסו לחוק באופן מלא ועתידות להיכנס
                בעתיד, עם זאת יש להן משקל חוקי מלא כל עוד התקנה בתוקף ויש
                להישמע להוראות המפורטות בהם באופן מלא.
              </Typography>
            </Box>
            <Box>
              <Typography variant="body2">
                דוגמא קטנה לתקנה כזו היא איסור הייבוא שחל נכון לעכשיו במדינת
                ישראל על כלים דמויי נשקים מפלטפורמות M4 למיניהן - כרגע זה לא
                בחוק עצמו אבל ככל הנראה יכנס בעתיד ואכן תהיה מגבלה על דגמים
                מסויים (מה שמוגדר היום כ"כלים מפוקחים").
              </Typography>
              <Link
                  sx={{
                    color: "blue",
                    "&:hover": {
                      color: "red",
                      textDecoration: "underline",
                    },
                    fontWeight: "bold",
                  }}
                  href="https://www.chamber.org.il/foreigntrade/1109/1110/128829/"
                  target="_blank"
                  rel="airsoft website2"
              >
                ניתן לראות את התקנה כאן
              </Link>
            </Box>
            <Typography variant="body2">
              <Typography variant="body2" color={'red'} fontWeight={'bold'}>
                עדכון חשוב!
              </Typography>
              דמויי כלי ירייה הם כלים המוגדרים בצו שפורסם בקובץ התקנות (צו דמויי כלי ירייה) התשפ"ד 2024.
              <br></br>
              באופן כללי מדובר על כלים שהינם מדגמי AR15, M16, M4, תבור, ובנוסף - מנגנון הירייה מבוסס גז
              (ירוק\אדום\שחור\CO2\HPA.. כל גז)
              <br></br>
              קובע החוק כי בעת תחילת הצו 6.2.2025, פעילות ייצור, יבוא, אחסנה, הובלה ומסחר בדמויי כלי ירייה יחוייבו
              ברישיון כפי שנדרש עבור כלי ירייה.
              <br></br>
              בנוסף, החזקה ונשיאה של דמויי כלי ירייה יעדו רק במועדוני דמויי כלי ירייה שקיבלו לכך רישיון מהאגף לרישוי כלי
              ירייה במשרד לביטחון לאומי.
              כמו כן, החזקת דמויי כלי ירייה מחוץ למועדונים, וכן רכישה, הובלה, יצור, ייבוא ומסחר בהם ללא רישיון יהוו
              עבירה פלילית שדינה עד 5 שנות מאסר.
            </Typography>
            <Link
                sx={{
                  color: "blue",
                  "&:hover": {
                    color: "red",
                    textDecoration: "underline",
                  },
                  fontWeight: "bold",
                }}
                href="https://www.gov.il/he/pages/order_similar_to_lrish_vessels?dicbo=v4-ZTsdp6k-1195017109-1"
                target="_blank"
                rel="airsoft website2"
            >
              ניתן לעיין בתוכן הצו כאן
            </Link>
            <Link
                sx={{
                  color: "blue",
                  "&:hover": {
                    color: "red",
                    textDecoration: "underline",
                  },
                  fontWeight: "bold",
                }}
                href="https://www.gov.il/he/pages/airsoft24"
                target="_blank"
                rel="airsoft website2"
            >
              ובצו האיירסופט \ תיקון חוק כלי ירייה כאן
            </Link>
            <Typography variant="body2">
              בכל מקרה על כל אזרח ושחקן החובה והאחריות האישית להכיר את נוסח החוק המעודכן והמדויק ביותר ולעמוד בו.
              ניתן להתעדכן בחוקים באתר המשרד לבטחון לאומי וכמו"כ אתר האגף לרישוי כליה ירייה.
            </Typography>
          </Stack>
        </Stack>
    )
  },
  {
    id: 2,
    value: `panel3`,
    heading: 'איך קונים כלי איירסופט?',
    detail: (
        <>
          <Stack spacing={2}>
            <Box>
              <Typography
                  color={"primary.darker"}
                  variant="h5"
                  sx={{ textDecoration: "underline" }}
              >
                חנויות
              </Typography>

              <Typography variant="subtitle1" color={"success.light"}>
                יתרון:
              </Typography>
              <Typography variant="body2">
                כלים חדשים מהקופסא, אם החנות טובה אז גם יש למי לפנות כדי לקבל
                שירות ואחריות.
              </Typography>
            </Box>

            <Box>
              <Typography variant="subtitle1" color={"success.light"}>
                חיסרון:
              </Typography>

              <Stack spacing={1}>
                <Typography variant="body2">
                  אין הרבה חנויות טובות (או בכלל) ואין אפילו טיפת פיקוח ברמה
                  הצרכנית - ולכן בדרכ המחירים מטורפים, והרמאויות חוגגות (כן כן
                  גם בחנויות רשמיות לא חסר רמאים, זו פשוט האמת).
                </Typography>

                <Typography variant="body2">
                  באופן כללי, קניה של כלים בחנויות היא לא תמיד האופציה הכי זולה,
                  ובכל מקרה אין המון אופציות. בישראל יש חנויות בודדות שמוכרות
                  ציוד איירסופט באופן רשמי, והן ברכ לא פתוחות או לא מוכרות כלים
                  (בקושי גז כדורים וציוד היקפי שגם ככה יותר זול להזמין מחו"ל),
                  והמחירים משתנים בעשרות ומאות אחוזים מדי שבוע לפי מזג האוויר
                  וכמה שנראה למוכרים שהם יכולים לגבות באותו רגע.
                </Typography>
                <Typography variant="body2">
                  זה נובע מכך שיש מעט חנויות עם מונופול על התחום וכל פעם שקורה
                  במדינה משהו (למשל מלחמה) שמשפיע על הביקוש או ההיצע המחירים
                  ישתנו באלפי שקלים, רשיונות היבוא מוגבלים בכמות שנתית ולכן
                  המוכרים תמיד ינסו לעשות כמה שיותר כסף על מה שהם כבר ייבאו
                  ונתקעו איתו..
                </Typography>
                <Typography variant="body2">
                  נפוץ למצוא מקרים שבהם שני שחקנים שונים נכנסו לאותה חנות באותו
                  שבוע וכל אד מהם יצא עם כלי זהה לחלוטין אבל במחירים שונים במאות
                  שקלים אחד מהשני, רק כי אחד מהם נראה קצת יותר בזבזן או עמיד
                  כלכלית ודחפו לו מחיר יותר גבוה במעמד הקניה.
                </Typography>
                <Typography variant="body2">
                  רק להמחשה - כלים דמויי אקדח שעלו ביום יום 1000-1500 שקלים
                  נמכרו בחודשים הראשונים של המלחמה ב5-6 אלף שקל - וגם זה בעיקר
                  לאזרחים מפוחדים שרצו להגן על עצמם או שחקנים חדשים שאין להם
                  מושג.
                </Typography>
                <Typography variant="body2">
                  אתם תמצאו (בקלות) חנויות שבהן הכלים והציוד בלי מחירים אפילו
                  (שזה בפני עצמו לא חוקי בעליל), ומלאי הכלים גם לא נמצא על המדף
                  וכל כלי המוכר צריך "ללכת להביא מהמחסן", ואתם בסוף מקבלים קיט
                  "מקורי" חצי מלא במחיר מופרז בלי פיקוח ובלי אחריות.
                </Typography>
                <Typography variant="body2">
                  כמו"כ לא חסר חנויות שעובדות על שחקנים עם כל מיני "תוכניות
                  תשלומים" ואז לוקחות כסף ולא נותנות שירות ולא כלים ולא כלום,
                  בדיקה זריזה מול הקהילה תמיד מומלצת - מהר מאוד תדעו בדיוק ממי
                  להתרחק.
                </Typography>
              </Stack>
            </Box>
          </Stack>
          <Box>
            <Typography
                color={"primary.darker"}
                variant="h5"
                sx={{ textDecoration: "underline" }}
            >
              יד 2
            </Typography>

            <Stack spacing={1}>
              <Typography variant="body2">
                באופן כללי זה עניין של מזל, קצת בדומה ליבוא אישי..
              </Typography>

              <Typography variant="body2">
                מעבר לאתר יד2 המוכר והאהוב - ישנן קבוצות טלגרם ו-וואטסאפ רבות
                לכל נושאי מכירה וקניה של ציוד וכלים וניתן למצוא בהן גם ציוד חדש
                לגמרי ולא רק יד2, אבל פה יש אפילו יותר פריצות, מצד אחד יש מצב
                למצוא דיל מדהים במחיר טוב, ומצד שני יש גם אנשים שמציגים העברות
                מזוייפות בביט ואפליקציות דומות ובורחים עם הכלים ועם הכסף…
              </Typography>

              <Typography variant="body2">
                בשורה התחתונה הכי חשוב להתייעץ! עם שחקנים אחרים\ עם הקפטן שלכם\
                עם הקהילה.. ישנן גם קבוצות פתוחות לשיח על אימות מחירים ומכירות
                ושאלות חופשיות על כלים, מחירים סבירים וכו'.. ושם כדאי להעלות
                לדיון שאלות ספציפיות ולראות האם העסקה שמוצעת לכם נראית הגיונית
                גם לשאר הקהילה ולאנשים עם יותר ניסיון מכם.
              </Typography>
            </Stack>
          </Box>
        </>
    )
  },
  {
    id: 3,
    value: `panel4`,
    heading: 'איפה מותר לשחק איירסופט?',
    detail: (
        <Typography variant="body2">
          מותר לשחק אך ורק במקומות רשמיים שעברו אישור והכרה על ידי הרשויות
          בישראל, בדומה לכל זירות הפיינטבול הקיימות, גם זירות איירסופט עוברות
          אישורים ותקנון ונמצאות תחת פיקוח, עם זאת, במדינת ישראל יש זירות
          "רשמיות" בודדות בלבד.
        </Typography>
    )
  },
  {
    id: 4,
    value: `panel5`,
    heading: 'איפה אסור לשחק איירסופט?',
    detail: (
        <>
          <Stack spacing={1}>
            <Typography variant="body2">
              <Typography
                  color={"success.light"}
                  variant="subtitle1"
                  component={"span"}
              >
                חוקית -
              </Typography>
              &nbsp; אסור לשחק בכל מקום שאינו זירה רשמית מאושרת, נכון, יש המון
              זירות פרילנסרים שאפילו שוטרים משחקים בהן והמשטרה מכירה את הפעילות
              בה ומעלימה עין, ויש גם זירות "קבוצתיות", אבל בשורה התחתונה על פי
              החוק כולם באופן גורף פולשים לשטחים ומבצעים בהם פעילות לא חוקית.
            </Typography>

            <Typography variant="body2">
              <Typography
                  color={"success.light"}
                  variant="subtitle1"
                  component={"span"}
              >
                ישנן קבוצות מועטות שלהן ניתנה גישה פרטית או אישור פרטני מבעלי
                השטח להשתמש בו למשחקי איירסופט -
              </Typography>
              &nbsp; הפעילות שלהן חוקית לגמרי והן קבוצות ברות מזל, אך יש לזכור
              שכל עוד הזירה אינה רשמית ומאושרת - אין ביקורת או אכיפה בטיחותית
              רשמית באף רמה, ואין ביטוח לשחקנים ולכן פציעות עלולות לסכן את כל
              המעורבים, ולכן לרוב פשוט לא מדווחות.
            </Typography>

            <Typography variant="body2">
              <Typography
                  color={"success.light"}
                  variant="subtitle1"
                  component={"span"}
              >
                שטחים שמוגדרים "שטח קבוצתי" אבל הם לא מהשטחים המפורטים פה -
              </Typography>
              &nbsp; בדרכ פשוט נקראים ככה כי איזו קבוצה השתלטה עליו ע"י זה שהיא
              נוהגת לשחק בו הרבה ואם תגיעו לשם יעיפו אתכם בבריונות או שיתקשרו
              עליכם למשטרה ועלילו שאתם מתרוצצים עם נשקים ועושים בלאגן.
            </Typography>
          </Stack>

          <Typography mt={"15px"} variant="h3" color={"primary.darker"}>
            כן, בכל זאת ישראל.
          </Typography>
        </>
    )
  },
  {
    id: 5,
    value: `panel6`,
    heading: 'איזה ציוד חייבים כדי להתחיל לשחק?',
    detail: (
        <>
          <Typography variant="subtitle1">
            קודם כל והכי חשוב - מיגון עיניים ופנים תקני. בנושא זה אין שום הנחות,
            אף פעם.
          </Typography>
          <Typography variant="body2">
            המינימום שנדרש כדי להתחיל לשחק זה מיגון וכלי, חלק מהשחקנים מתחילים
            עם רפליקות של כלים ארוכים וחלק עם רפליקות של אקדחים, יש שחקנים
            שמגיעים ביום הראשון כמו לוחם שייטת משופצר לגמרי, ויש שחקנים שמשחקים
            עשר שנים עם מכנסי טרנינג וקפוצ'ון, בשורה התחתונה כל מה שצריך זה
            מיגון וכלי, כל השאר זה תחפושות, שפצורים ושיפורים מגניבים לציוד כמו
            רימוני עשן, רימוני איירסופט, מגיני פריצה, מטולים, מקלעים… הרשימה
            אינסופית וכל שחקן משקיע כמה שבא לו ומשחק איך שנוח לו, אין גבול למה
            שאפשר להביא.
          </Typography>
        </>
    )
  },
  {
    id: 6,
    value: `panel7`,
    heading: 'מה ההבדל בין מועדון לקבוצת איירסופט?',
    detail: (
      <Stack spacing={2}>
        <Typography color={"primary.darker"} variant="h5">
          נכון להיום החוק מגדיר שלוש ישויות בתחום האיירסופט: "יבואן",
          "מועדון" ו"חבר מועדון"
        </Typography>

        <Box>
          <Typography variant="subtitle1" color={"success.light"}>
            יבואן:
          </Typography>
          <Typography variant="body2">
            הוא מי שקיבל רישיון יבוא ממשרד הכלכלה והתעשייה, על מנת לקבל
            רישיון יבוא יש לעמוד בתנאים נוקשים ואפשר להגיש בקשה באתר של משרד
            הכלכלה והתעשייה, זה לא תהליך קל ומצריך גם שטח תפעולי, וגם רשימת
            ציוד שעליו רוצים לקבל רישיון, הרישיון אינו חופשי וניתן לכמות
            מסויימת של ציוד מפורט מראש.
          </Typography>
        </Box>

        <Box>
          <Typography variant="subtitle1" color={"success.light"}>
            מועדון:
          </Typography>
          <Typography variant="body2">
            הוא למעשה ההתארגנות המינימלית שהחוק מגדיר על מנת לעסוק בתחום
            האיירסופט, על כל שחקן להירשם תחת מועדון ולעמוד בתקנות שנקבעו
            בחוק על מכירה, שינוע (שינוע ולא נשיאה!! נשיאה אסורה מחוץ לשטחי
            משחק באופן גורף!), אחסנה ושימוש בכלי איירסופט.
          </Typography>
        </Box>

        <Box>
          <Typography variant="subtitle1" color={"success.light"}>
            חבר מועדון:
          </Typography>
          <Typography variant="body2">
            הוא מי שנרשם תחת מועדון פעיל ויש לו כרטיס חבר מועדון (אם כי החוק
            מחייב רישום במועדון ולא בהכרח נשיאת כרטיס).
          </Typography>
        </Box>

        <Box>
          <Typography variant="subtitle1" color={"success.light"}>
            קבוצה:
          </Typography>
          <Typography variant="body2">
            זה פשוט מונח שהשתמשנו בו עד היום, לפני הטרמינולוגיה הרשמית
            והתקנון החוקי. היום אפשר להניח שכל קבוצה תירשם כמועדון, ואולי
            למועדונים יהיו חבורות פנימיות שיהוו קבוצות נפרדות, כל אחת עם
            הרכב וסמלים משלה - אבל בשורה התחתונה כרגע התארגנות כ"קבוצה" או
            "צוות" אינה מוגדרת בחוק כיישות רשמית.
          </Typography>
        </Box>
      </Stack>
    )
  },
  {
    id: 7,
    value: `panel8`,
    heading: 'מותר לי להביא איתי כלי איירסופט מחו"ל?',
    detail: (
      <Typography variant="body2">
        התשובה היא בגדול בדיוק אותה תשובה להזמנות ציוד מחו"ל, אבל ללא ספק
        הרבה יותר קל להביא בעצמך וסיכויי הכניסה גדולים בהרבה כי לא כל דבר
        עובר בנפרד, לרוב כל ציוד שאינו כלי פשוט עובר בלי שום בעיות במזוודה,
        צריךלשים לב לתקנות בנושאי אופטיקה וכוונות, אבל כל עוד יש לכם קבלות
        והוכחות שקניתם צעצוע אתם כנראה תהיו בסדר, רק שימו לב שבכל מקרה אסור
        ליבא כמות מסחרית של ציוד או בכלל כל כמות שאינה לשימוש אישי
      </Typography>
    )
  },
  {
    id: 8,
    value: `panel9`,
    heading: ' מותר להזמין כלים וציוד איירסופט מחו"ל?',
    detail: (
        <Stack spacing={1}>
          <Typography variant="body2">
            עם הזמן וככל שהנושא מתוקנן יותר - נעשה יותר קשה להזמין כלים
            ובוודאי ש"כלים מפוקחים" אבל באופן כללי היות וצריך רישיון יבוא - כל
            הזמנה של ציוד איירסופט שנתפסת במכס תושמד או תוחזר לשולח. מכיוון
            וזה לא עבירה להזמין כלי איירסופט, אין ממש סכנה פלילית, וזה בעיקר
            עניין של מזל וסיכון כספי..
          </Typography>
          <Typography variant="body2">
            באופן עקרוני כל חבילה שרשומה עליה המילה Airsoft תהיה בסיכון גבוה
            לבעיות מכס, חלק מהמוכרים שולחים כלים מפורקים במספר חבילות, חלקם
            שולחים כלים ורושמים בתיאור "toy parts" או משהו שמעיד באופן ברור על
            כך שמדובר בצעצוע "רגיל"
          </Typography>
          <Typography variant="body2">
            (כן, נכון שגם כלי איירסופט הוא צעצוע.. אבל המילה מדליקה למכס נורות
            אדומות כי זה מוגדר "צעצוע מסוכן" ונמצא תחת פיקוח) זה כל כך חסר
            ניואנסים שגם משקפות, מסיכות מגן, נרתיקים, כדורים, יחידות טרייסר…
            אם כתוב על החבילה שזה קשור לאיירסופט המכס פשוט לא מעביר את הציוד.
            בקיצור - עניין של מזל 🙂
          </Typography>
        </Stack>
    )
  },
  {
    id: 9,
    value: `panel10`,
    heading: 'האם כלי איירסופט יכול לשמש אותי להגנה עצמית?',
    detail: (
      <Stack spacing={1}>
        <Typography variant="h3" color={"error.main"}>
          לא!
        </Typography>
        <Typography variant="body2">
          חד משמעית לא! אולי אם מישהו יתקוף אתכם עם נשק קר תוכלו להטריד או
          להרתיע אותו, וגם כלים חזקים במיוחד עם כדורי ברזל הם אינם קטלניים
          ובעיקר יכולים לגרום לפציעות, אבל חמורות ככל שיהיו, זה לא מאפשר לנו
          להשתמש בכלי איירסופט כאמצעי הגנה עצמית אמין, מספיק שהתוקף לבוש
          בצורה סבירה והכדורים לא יחדרו.. גם אם הם מפוצצים בקבוקי בירה בחצר
          שלכם.
        </Typography>

        <Typography variant="body2">
          כלי איירסופט אפילו מסכן את הנושא אותו יותר מאדם ממוצע שנקלע למצבי
          ירי, היות וזה הופך אותך למטרה בלי יכולת אמיתית להתגונן. והכי חשוב
          -{" "}
          <Typography variant="h3" color={"error.main"} component={"span"}>
            זה לא חוקי לשאת על גופך כלי איירסופט מחוץ לזירת משחק.
          </Typography>
        </Typography>
      </Stack>
    )
  }
]

export {
  FAQS
}
