const STORE_PRIVACY_ITEMS = [
  'מכירת המוצרים מותרת למי שמלאו לו 18 שנים ורשאי על-פי חוק לרכוש מוצרים אלו. הן בתהליך המכירה והן בתהליך\n' +
  '  האיסוף, החברה שומרת לעצמה את הזכות להתנות את המכירה ו/או המסירה בדרישת פרטים מזהים שיאפשרו אימות.',
  'המכירה תתבצע במדינת ישראל בלבד וכפוף לחוק הישראלי.',
  ' הרכישה באתר תתבצע באמצעות טופס הזמנה מקוון בו עליכם לבחור את המוצרים ו/או השירותים בהם אתם מעוניינים.\n' +
  ' בטופס ההזמנה יהיה עליכם לבחור, במידת האפשר, את הצבע, הכמות והמידה עבור כל מוצר',
  '  הרכישה באתר תתבצע באמצעות טופס הזמנה מקוון בו עליכם לבחור את המוצרים ו/או השירותים בהם אתם מעוניינים.\n' +
  ' בטופס ההזמנה יהיה עליכם לבחור, במידת האפשר, את הצבע, הכמות והמידה עבור כל מוצר.',
  'לצורך רכישה בחנות האינטרנטית airsoft4u, לרבות, לצורך רכישת מוצרים, תתבקש למלא פרטים בסיסים אודותיך, בין\n' +
  '              היתר: שם, דוא”ל, פרטי כרטיסי אשראי, כתובת למשלוח ההזמנה וכו\'.. על מנת שההזמנה תושלם בזמן וללא תקלות יש\n' +
  ' להקפיד על מסירת פרטים נכונים אחרת לא תוכל החברה להבטיח את ביצוע ההזמנה.',
  'עלייך האחריות למלא את הפרטים בצורה נכונה, אחרת לא תוכל החברה להבטיח את השלמת ההזמנה.',
  'בעת ביצוע ההזמנה על ידי הלקוח, החברה תבדוק את פרטי כרטיס האשראי ועם קבלת אישור הזמנה ע”י חברות האשראי, ההזמנה תאושר והלקוח יקבל הודעה על כך לכתובת הדוא”ל אותו הזין בעת ביצוע ההזמנה. במידה והעסקה לא תאושר ע”י חברת האשראי, תשלח הודעה ללקוח ויהיה עליו למסור אמצעי תשלום אחר וזאת עד לקבלת אישור חברת האשראי בגין הכרטיס האחר כאמור.',
  'מובהר כי חיוב הלקוח בגין עלות המוצר או השירות הנרכש על ידיו, יתבצע באמצעות כרטיס האשראי מיד עם סיום ביצוע ההזמנה.',
  'אין להשתמש במוצרי החנות או בשירותי החנות לצורך ממכר חוזר ללקוחות צד שלישי.',
  'זמן ההספקה הוא עד 14 ימי עבודה (ימים א-ה לא כולל ימי שישי, שבת, ערבי חג וחג) בהתאם למקום האספקה והמוצרים שהוזמנו.',
  'החברה רשאית לשנות ו/או לבטל כל מבצע או הטבה בכל עת, לפי שיקול דעתה הבלעדי ומכל סיבה שהיא.',
  'החברה אינה גוף טכנולוגי ולא תישא בשום אחריות לנושאים טכניים, לרבות אי זמינות האתר, טעויות הנגרמות בעת תרגום אוטומטי, בעיות בתקשורת עם האתר וכו’.',
]

export {
  STORE_PRIVACY_ITEMS
}
