import Box from '@mui/material/Box';
import Typography from '@mui/material/Typography';
import Stack from '@mui/material/Stack';
import { STORE_PRIVACY_ITEMS } from "../data/privacy";
import {useQueryParams} from "../../../hooks/useCommon.ts";
import {useMemo} from "react";

const Privacy = () => {
  const query = useQueryParams()

  const isStore = useMemo(() => {
    return query.get('type') === 'store'
  }, [query])

  return (
    <Box>
      <Stack spacing={1} pb={2}>
        <Typography
          component="p"
          color="text.secondary"
        >
          {!isStore ? 'אתר איירסופט ישראל (https://israelairsoft.com) ("האתר המארח") הינו פורטל מידע ציבורי המכיל חנויות אינטרנט פרטיות שפועלות באופן עצמאי ומפורסמות באתר לטובת ריכוז ואיסוף מידע שימושי עבור קהילת השחקנים, האתר מופעל באופן התנדבותי ואינו אחראי לכל תוכן שמפורסם עי צד שלישי (ובכלל משתמשים באתר כגון שחקן, קבוצה, חנות מתארחת, טכנאי, משכיר, סוחר יד2 וכו\'..) בכל נושא ובכל תחום.' : '' +
            'אתר איירסופט ישראל (https://israelairsoft.com) ("האתר המארח") הינו פורטל מידע ציבורי המכיל חנויות אינטרנט פרטיות שפועלות באופן עצמאי ומפורסמות באתר לטובת ריכוז ואיסוף מידע שימושי עבור קהילת השחקנים, האתר מופעל באופן התנדבותי ואינו אחראי לכל תוכן שמפורסם עי צד שלישי (ובכלל משתמשים באתר כגון שחקן, קבוצה, חנות מתארחת, טכנאי, משכיר, סוחר יד2 וכו\'..) בכל נושא ובכל תחום.\n' +
            'האתר אינו אחראי לכל פעולה שנעשית מול חנות המתארחת באתר ואינו נושא על עצמו שום סוג של אחריות למוצרים או תקינותם, עסקאות, מלאי, פרסומים, פרטי לקוחות וכל דבר בין אם צוין כאן או לא.\n' +
            'כל רכישה או התקשרות בין קונה למוכר באתר נעשית באחריותם הבלעדית וכפופה לחוק, ללא מעורבות של בעלי האתר.'}
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          {!isStore ? 'האתר אינו אחראי לכל פעולה שנעשית מול חנות המתארחת באתר ואינו נושא על עצמו שום סוג של אחריות למוצרים או תקינותם, עסקאות, מלאי, פרסומים, פרטי לקוחות וכל דבר בין אם צוין כאן או לא.' : 'כל עסקה שנעשית בחנות דרך האתר תיחשב כעסקה שנעשתה בין הלקוח לחנות בלבד ללא מעורבות של האתר המארח, וכל התקשרות נוספת תהיה ישירות מול בית העסק מולו התבצעה העסקה.\n' +
            'במידה ומצאתם טעות או עבירה ניתן לדווח למפעילי האתר ישירות באמצעות טופס "צור קשר" אליו ניתן להגיע מכל מקום באתר, ואנחנו נדאג לתקן את הטעות במהירות האפשרית.\n'}
        </Typography>
        {!isStore && <Stack spacing={2}>
        <Typography
          component="p"
          color="text.secondary"
        >
          כל רכישה או התקשרות בין קונה למוכר באתר נעשית באחריותם הבלעדית וכפופה לחוק, ללא מעורבות של בעלי האתר.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          כל עסקה שנעשית בחנות דרך האתר תיחשב כעסקה שנעשתה בין הלקוח לחנות בלבד ללא מעורבות של האתר המארח, וכל התקשרות נוספת תהיה ישירות מול בית העסק מולו התבצעה העסקה.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          במידה ומצאתם טעות או עבירה ניתן לדווח למפעילי האתר ישירות באמצעות טופס "צור קשר" אליו ניתן להגיע מכל מקום באתר, ואנחנו נדאג לתקן את הטעות במהירות האפשרית.
        </Typography>
        </Stack>}
      </Stack>
      {isStore && <Stack spacing={1} pb={2}>
        <Typography
          variant="h6"
          gutterBottom
          sx={{
            fontWeight: 'medium',
          }}
        >
          תקנון חנות אינטרנטית Airsoft 4 u (“החברה“).
        </Typography>
        <Typography
          variant="subtitle1"
          sx={{
            fontWeight: 'medium',
          }}
        >
          להלן הסכם השימוש בחנות הכולל את מחויבותנו ללקוח, וכך גם את תנאי השימוש בשירותים המוצעים:
        </Typography>
        <ol style={{paddingRight: 24}}>
          {STORE_PRIVACY_ITEMS.map((item) => (
            <li key={item}>
              <Typography
                pt={1}
                component="p"
                color="text.secondary"
              >
                {item}
              </Typography>
            </li>
          ))}
        </ol>
      </Stack>}

      {isStore && <Stack spacing={1} pb={2} pt={2}>
        <Typography
          variant="h6"
          gutterBottom
          sx={{
            fontWeight: 'medium',
          }}
        >
          ביטול עסקה והחזרת סחורה תתאפשר בהתאם להוראות המפורטות להלן:
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          הלקוח יהא רשאי לבטל את העסקה ולקבל החזר כספי, או לחילופין, להחליף את המוצר כנגד מוצר חלופי שווה ערך או זיכוי כספי בהתאם ובכפוף לכל הוראות הדין ולרבות הוראות חוק הגנת הצרכן, התשמ”א – 1981, והתקנות מכוחו, הכול כמפורט להלן.
        </Typography>
      </Stack>}
      {isStore && <Stack pt={2} spacing={2}>
        <Typography
          variant="h6"
          gutterBottom
          sx={{
            fontWeight: 'medium',
          }}
        >
          הנך רשאי לבטל עסקה באמצעות פנייה לשירות הלקוחות כאמור בתנאים הבאים, כפי שיעודכנו מעת לעת על ידי החברה בהודעה בת 14 ימים אשר תפורסם באתר החברה:
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          לפני שליחת המוצר/ים – ביטול העסקה בתוך שעה מרגע השלמת הזמנת המוצרים באתר ולפני משלוח המוצר – יעשה באמצעות הודעת ביטול טלפונית לשירות הלקוחות בטלפון: ‏0525-556-635. בנסיבות כאמור יהיה הלקוח זכאי לקבל החזר עבור התשלום במלואו (לרבות בגין דמי המשלוח, ככל שנגבו) ובלבד שכרטיס האשראי שלך חויב בגין הרכישה שביטולה מבוקש.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          לאחר קבלת המוצרים -
           במקרה של ביטול עסקה עקב פגם במוצר ו/או אי התאמה, לרבות מוצרים שנמכרו בהנחה, הנך זכאי לבטל את הרכישה בתוך 14 יום ממועד האספקה ובלבד שלא נעשה כל שימוש במוצרים והם באריזתם המקורית ושלא הוסרו תוויות המוצר. על מנת להיות זכאי לבטל עסקה עקב פגם במוצר, על הלקוח לבדוק את המוצר או הפריט מיד עם קבלתו. במידה והמוצר התקבל בידי הלקוח כשהוא פגום, או כאשר מפרט המוצר בפועל שונה מן המפרט שהוצג באתר, כי אז רשאי הלקוח לבטל את העסקה בתוך 14 יום מיום קבלת המוצר לידיו באמצעות השבת המוצר לאחת מחנויות החברה בצירוף חשבונית המעידה על הרכישה של המוצר שהשבתו מבוקשת.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          במקרה של ביטול עסקה שלא עקב פגם במוצר ו/או אי התאמה, הלקוח יהא רשאי לבטל את עסקת הרכישה בתוך 14 יום מיום קבלת המוצר ובלבד שלא נעשה כל שימוש במוצרים והם באריזתם המקורית. ביטול העסקה יבוצע באמצעות השבת המוצר לאחת מחנויות החברה בצירוף חשבונית המעידה על הרכישה של המוצר שהשבתו מבוקשת. במקרה של ביטול עסקה שלא עקב פגם במוצר ו/או אי התאמה, לא יוחזרו דמי המשלוח.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          בעת השבת המוצר, על הלקוח למלא טופס החזרה הכולל פרטי זיהוי כגון מספר הזמנה וכן את סיבת ההחזרה.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          מובהר, כי יש לשמור על האריזה המקורית כתנאי להחזרת המוצרים.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          החברה תבדוק את המוצרים המוחזרים ובמידה ותמצא, לפי שקול דעתה, כי המוצרים תקינים (במקרה של החזרת המוצרים שלא עקב פגם במוצר ו/או אי התאמה), שלא נעשה בהם שימוש ושהמוצרים באריזתם המקורית ושלא הוסרו תוויות המוצר וברצונך לבטל את העסקה, החברה תזכה אותך בסכום הרכישה במועד שבו התקבלו המוצרים בחנויות החברה.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          על אף האמור, מובהר כי לא יינתן זיכוי כספי בגין מוצרים שלא שולמה בגינם תמורה כספית, כגון מבצעים או מתנות.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          אדם עם מוגבלות (כהגדרתו בחוק שוויון זכויות לאנשים עם מוגבלות, התשנ”ח-1998), אזרח ותיק (מי שמלאו לו 65 שנים) או עולה חדש (מי שטרם חלפו חמש שנים מיום שניתנה לו תעודת עולה או תעודת זכאות כעולה ממשרד העלייה והקליטה) רשאי לבטל עסקה בתוך ארבעה (4) חודשים ממועד ביצוע ההזמנה. החברה רשאית לבקש תעודה מהגורם המבטל כאמור לצורך אימות האמור.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          בוטלה עסקה כאמור, החברה לא תהיה אחראית ולא תישא בכל נזק, לרבות ומבלי לגרוע, ישיר, עקיף, תוצאתי או מיוחד שנגרם ללקוח ו/או לצד שלישי.
        </Typography>
        <Typography
          variant="subtitle1"
          sx={{
            fontWeight: 'medium',
          }}
        >
          מבלי לגרוע מהוראות תקנון זה, החברה רשאית בכל עת, על פי שיקול דעתה הבלעדי, להפסיק את הפעילות באתר ו/או לבטל עסקת רכישה שביצעה לקוח, מכל סיבה שהיא, לרבות ומבלי לגרוע, בגין כל אחד מהמקרים הבאים:
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          המוצרים אזלו מהמלאי
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          לא נקלטו פרטיו המלאים של הלקוח לרבות פרטי כרטיס האשראי.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          הלקוח הזין (בין אם ביודעין ובין אם לאו) פרטים לא נכונים (לרבות ומבלי לגרוע כתובת למשלוח שגויה) ולא ניתן ליצור עמו קשר טלפוני או בדוא”ל לקבלת כתובת נכונה תוך 7 ימים ממועד ביצוע ההזמנה.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          הלקוח פעל בניגוד לאמור בתקנון זה.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          הלקוח פעל באופן לא חוקי ו/או בניגוד להוראות כל דין.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          הלקוח מנסה או ניסה לחבל בפעילות האתר ובביצוע ההזמנות באתר.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          אם כרטיס האשראי שברשות הלקוח נחסם או הוגבל לשימוש בדרך כלשהי.
        </Typography>
        <Typography
          component="p"
          color="text.secondary"
        >
          במצב של כוח עליון.
        </Typography>
      </Stack>}
    </Box>
  );
};

export { Privacy };
